songz/app/controllers/users_controller.rb

    def create
        # debugger
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "chrisshanna"], ["session_token", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2023-05-10 00:20:38.884445"], ["updated_at", "2023-05-10 00:20:38.884445"]]