songz/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-05-10 00:08:34.618944"], ["id", 4]]
---
    def reset_session_token!
      self.session_token = SecureRandom:urlsafe_base64
      self.save!

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_session_token
      #not called in the reset_session_token! method, but deals with edge cases of session token duplicates
      loop do
        session_token = SecureRandom::urlsafe_base64
        return session_token unless User.exists?(session_token: session_token)